gdb/gdb_practices.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 14:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用 GDB 调试程序</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="lsl" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">使用 GDB 调试程序</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0322056">1. 调试单进程</a></li>
<li><a href="#orgb652e53">2. 调试多进程</a></li>
<li><a href="#org41a1d67">3. 调试多线程死锁</a></li>
<li><a href="#orga58459a">4. 调试 core dump 文件</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0322056" class="outline-2">
<h2 id="org0322056"><span class="section-number-2">1</span> 调试单进程</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;iostream&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">div</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">a</span>, <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">b</span>) {
    <span style="color: #a1db00;">return</span> a/b;
}

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #a1db00;">for</span> (<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">i</span>=0; i&lt;10; ++i) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; div(10+i, 10-i) &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
    }
    <span style="color: #a1db00;">return</span> 0;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgb652e53" class="outline-2">
<h2 id="orgb652e53"><span class="section-number-2">2</span> 调试多进程</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-c++">
</pre>
</div>
</div>
</div>
<div id="outline-container-org41a1d67" class="outline-2">
<h2 id="org41a1d67"><span class="section-number-2">3</span> 调试多线程死锁</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;iostream&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;pthread.h&gt;</span>

<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">Arg</span> {
    <span style="color: #00d7af;">double</span> <span style="color: #ff8700;">a</span>;
    <span style="color: #00d7af;">double</span> <span style="color: #ff8700;">b</span>;
};

<span style="color: #00d7af;">void</span>* <span style="color: #ffd700;">div</span>(<span style="color: #00d7af;">void</span> *<span style="color: #ff8700;">arg</span>) {
    <span style="color: #00d7af;">double</span> <span style="color: #ff8700;">a</span> = ((<span style="color: #00d7af;">Arg</span>*)arg)-&gt;a;
    <span style="color: #00d7af;">double</span> <span style="color: #ff8700;">b</span> = ((<span style="color: #00d7af;">Arg</span>*)arg)-&gt;b;
    <span style="color: #00d7af;">double</span> *<span style="color: #ff8700;">rval</span> = <span style="color: #a1db00;">new</span> <span style="color: #00d7af;">double</span>;
    *rval = a / b;
    <span style="color: #a1db00;">return</span> (<span style="color: #00d7af;">void</span>*)rval;
}

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #00d7af;">pthread_t</span> <span style="color: #ff8700;">tid</span>;
    <span style="color: #00d7af;">Arg</span> <span style="color: #ff8700;">param</span> = {1,2};
    <span style="color: #a1db00;">if</span> (<span style="color: #ff4b4b;">!</span>pthread_create(&amp;tid, <span style="color: #5fafd7;">NULL</span>, div,&amp;param)) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"create thread errorr"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
        <span style="color: #a1db00;">return</span> 1;
    }
    <span style="color: #00d7af;">double</span> *<span style="color: #ff8700;">ret</span> = <span style="color: #5fafd7;">NULL</span>;
    pthread_join(tid, (<span style="color: #00d7af;">void</span>**)&amp;ret);
    <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"return val is : "</span> &lt;&lt; *ret &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
    <span style="color: #a1db00;">delete</span> ret;

    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orga58459a" class="outline-2">
<h2 id="orga58459a"><span class="section-number-2">4</span> 调试 core dump 文件</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">      #include</span> <span style="color: #ff4ea3;">&lt;cstdio&gt;</span>

      <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">dump_code</span>(){
          <span style="color: #00d7af;">char</span>* <span style="color: #ff8700;">p</span> = (<span style="color: #00d7af;">char</span>*)0;
          *p = <span style="color: #ff4ea3;">'a'</span>;
      }

      <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
      {
          dump_code();
          <span style="color: #a1db00;">return</span> 0;
      }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">      g++ -g -S -O0 -m32 gdb_test.cc -o-|c++filt &gt;gdb_test.format.s
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: lsl</p>
<p class="email">Email: <a href="mailto:lsl@lsl-ThinkPad-X1-Carbon-5th">lsl@lsl-ThinkPad-X1-Carbon-5th</a></p>
<p class="date">Created: 2020-03-26 四 14:33</p>
<p class="validation"></p>
</div>
</body>
</html>
